[
    {
        "audioFileFullPath": "./audio/books/B002/B002C004_echo.mp3",
        "currentTimes": [
            {
                "ms": 0,
                "duration": 2.583,
                "tran": "súpərvàɪzd lɜ́rnᵻŋ - rəɡrɛ́ʃən."
            },
            {
                "ms": 2.583,
                "duration": 4.0329999999999995,
                "tran": "rəɡrɛ́ʃən ᵻz wʌ́n əv ðə sɛ́ntrəl ǽspɛ̀kts əv súpərvàɪzd lɜ́rnᵻŋ,"
            },
            {
                "ms": 6.616,
                "duration": 3.524000000000001,
                "tran": "praɪmɛ́rᵻli dᵻzáɪnd tə prədᵻ̀kt kəntᵻ̀njuəs áʊtkʌ̀mz."
            },
            {
                "ms": 10.14,
                "duration": 11.451999999999998,
                "tran": "wᵻð rúts ᵻn stətᵻ̀stᵻkəl mɒ́dəlᵻ̀ŋ, rəɡrɛ́ʃən ǽlɡərᵻ̀ðəmz ᵻn súpərvàɪzd lɜ́rnᵻŋ éɪm tə prədᵻ̀kt ə dəpɛ́ndənt vɛ́riəbəl béɪst ɒn wʌ́n ɔr mɔr ᵻ̀ndəpɛ́ndənt vɛ́riəbəlz, ʌ́ðərwàɪz nóʊn æz fíʧərz. "
            },
            {
                "ms": 21.592,
                "duration": 8.921000000000003,
                "tran": "ᵻn ɛ́səns, rəɡrɛ́ʃən ənǽlᵻsᵻs ətɛ́mpts tə mǽp ðə rəléɪʃənʃᵻ̀p bitwín ðiz fíʧərz ənd ðə tɑ́rɡət, ɔ́fən əksprɛ́st æz ə mæ̀θəmǽtᵻkəl fʌ́ŋkʃən."
            },
            {
                "ms": 30.513,
                "duration": 9.352999999999998,
                "tran": "ᵻt lɛ́vərᵻʤᵻz ðᵻs rəléɪʃənʃᵻ̀p tə prədᵻ̀kt kəntᵻ̀njuəs-vǽljud áʊtkʌ̀mz, sʌʧ æz prədᵻ̀ktᵻŋ háʊzᵻŋ práɪsᵻz béɪst ɒn fǽktərz láɪk loʊkéɪʃən, sáɪz, ənd əmɛ́nətiz, ɔr fɔ́rkæ̀stᵻŋ séɪlz béɪst ɒn hᵻstɔ́rᵻkəl déɪtə ənd mɑ́rkət trɛ́ndz. "
            },
            {
                "ms": 44.34,
                "duration": 9.163999999999994,
                "tran": "ðə sᵻmplᵻ̀sᵻti ənd ᵻntərprɛtəbᵻ̀lᵻti əv lᵻ̀niər rəɡrɛ́ʃən, wʌ́n əv ðə ɜ́rliəst ənd móʊst wáɪdli júzd rəɡrɛ́ʃən tɛkníks, lɛ́nd ᵻt ɛndjʊ́rᵻŋ pɒ̀pjəlɛ́rᵻti."
            },
            {
                "ms": 53.504,
                "duration": 7.574000000000005,
                "tran": "lᵻ̀niər rəɡrɛ́ʃən əsúmz ə lᵻ̀niər rəléɪʃənʃᵻ̀p bitwín ðə fíʧərz ənd ðə tɑ́rɡət vɛ́riəbəl, əksprɛ́st æz Y = mx + c, wɛ́r m ᵻz ðə slóʊp, c ᵻz ðə ᵻ̀ntərsɛ́pt, ənd X ᵻz ðə fíʧər vɛ́ktər."
            },
            {
                "ms": 66.286,
                "duration": 9.191999999999993,
                "tran": "ðə ɡóʊl ᵻz tə fáɪnd ðə vǽljuz əv m ənd c thət mᵻ̀nᵻmàɪz ðə dᵻ̀fərəns bitwín ðə prədᵻ̀ktᵻd ənd ǽkʧəl tɑ́rɡət vǽljuz əkrɔ́s ɔl déɪtə pɔ́ᵻnts ᵻn ðə tréɪnᵻŋ sɛ́t. "
            },
            {
                "ms": 75.478,
                "duration": 8.534000000000006,
                "tran": "hàʊɛ́vər, ríəlwɜ̀rld déɪtə ɔ́fən ᵻɡzᵻ̀bᵻts nɒnlᵻ̀nìər pǽtərnz, ənd sᵻ̀mpəl lᵻ̀niər rəɡrɛ́ʃən meɪ nɒt ǽdəkwətli kǽpʧər ðiz kəmplɛ́ksᵻtiz."
            },
            {
                "ms": 84.012,
                "duration": 9.229,
                "tran": "tə ǽdrɛ̀s ðᵻs, pɒ̀lìnóʊmiəl rəɡrɛ́ʃən əkstɛ́ndz ðə kɒ́nsɛpt əv lᵻ̀niər rəɡrɛ́ʃən baɪ ᵻ̀ntrədúsᵻŋ páʊərz əv ðə ərᵻ̀ʤᵻnəl fíʧərz æz nu fíʧərz."
            },
            {
                "ms": 93.241,
                "duration": 4.5049999999999955,
                "tran": "ðᵻs lídz tə ə mɒ́dəl thət kən kǽpʧər ə wáɪdər réɪnʤ əv pǽtərnz ᵻn ðə déɪtə, ɔ̀lðóʊ ðə rᵻ̀sk əv òʊvərfᵻ̀tᵻŋ ᵻ̀nkrìsᵻz wᵻð ðə dᵻɡrí əv ðə pɒ̀lìnóʊmiəl. "
            },
            {
                "ms": 102.243,
                "duration": 9.263000000000005,
                "tran": "rèɡjəlɛ̀rᵻzéɪʃən tɛkníks, néɪmli L1 ənd L2 rɛ̀ɡjəléɪʃənz, ɔ́fər ən əféktᵻv mínz əv kəntróʊlᵻŋ òʊvərfᵻ̀tᵻŋ ᵻn rəɡrɛ́ʃən mɒ́dəlz."
            },
            {
                "ms": 111.506,
                "duration": 11.403999999999996,
                "tran": "L1 rɛ̀ɡjəléɪʃən, ɔr lǽsu, ǽdz ən ǽbsəlùt vǽlju əv mǽɡnᵻtùd əv kòʊəfᵻ̀ʃənt æz pɛ́nəlti tɜ́rm tə ðə lɔ́s fʌ́ŋkʃən, rəzʌ́ltᵻŋ ᵻn spɑ́rs səlúʃənz wᵻð fjúər nɒnzíroʊ kòʊəfᵻ̀ʃənts."
            },
            {
                "ms": 122.91,
                "duration": 9.644000000000005,
                "tran": "L2 rɛ̀ɡjəléɪʃən, ɔr rᵻ̀ʤ, ǽdz skwɛ́rd mǽɡnᵻtùd əv kòʊəfᵻ̀ʃənt æz pɛ́nəlti tɜ́rm tə ðə lɔ́s fʌ́ŋkʃən, lídᵻŋ tə smɔ́lər kòʊəfᵻ̀ʃənt vǽljuz bʌt nɒt zíroʊ. "
            },
            {
                "ms": 132.554,
                "duration": 4.332999999999998,
                "tran": "ðə mɒ́dəlz pərfɔ́rməns ᵻz ə krᵻ̀tᵻkəl mɛ́ʒər ᵻn rəɡrɛ́ʃən ənǽlᵻsᵻs."
            },
            {
                "ms": 136.887,
                "duration": 7.23599999999999,
                "tran": "mín skwɛ́rd ɛ́rər (MSE), mín ǽbsəlùt ɛ́rər (MAE), ənd r-skwɛ́rd ɑr kɒ́mənli júzd mɛ́trᵻks."
            },
            {
                "ms": 144.123,
                "duration": 14.99600000000001,
                "tran": "ðə MSE ənd MAE mɛ́ʒər ðə ǽvərᵻʤ əv ðə skwɛ́rd ənd ǽbsəlùt dᵻ̀fərənsᵻz, rəspɛ́ktᵻvli, bitwín prədᵻ̀ktᵻd ənd ǽkʧəl vǽljuz, wáɪl r-skwɛ́rd rɛ̀prəzɛ́nts ðə prəpɔ́rʃən əv ðə vɛ́riəns ᵻn ðə dəpɛ́ndənt vɛ́riəbəl thət ᵻz prədᵻ̀ktəbəl frəm ðə ᵻ̀ndəpɛ́ndənt variable(s)"
            },
            {
                "ms": 159.119,
                "duration": 6.812999999999988,
                "tran": "əʤʌ́stᵻd r-skwɛ́rd fɜ́rðər rᵻfáɪnz ðə r-skwɛ́rd baɪ téɪkᵻŋ ᵻntu əkáʊnt ðə nʌ́mbər əv prədᵻ̀ktərz ᵻn ðə mɒ́dəl."
            },
            {
                "ms": 165.932,
                "duration": 2.4220000000000255,
                "tran": "æz wᵻð ɔl məʃín lɜ́rnᵻŋ tɛkníks,"
            },
            {
                "ms": 168.354,
                "duration": 5.126999999999981,
                "tran": "déɪtə prɛ̀pəréɪʃən ənd prìprʌ́ʊsɛsᵻŋ pléɪ ə sᵻɡnᵻ̀fᵻkənt róʊl ᵻn rəɡrɛ́ʃən tǽsks."
            },
            {
                "ms": 173.481,
                "duration": 7.7520000000000095,
                "tran": "ðə prɛ́zəns əv áʊtlaɪərz kən sᵻɡnᵻ̀fᵻkəntli skjú ðə rəɡrɛ́ʃən láɪn, hɛ́ns áʊtlaɪər dᵻtɛ́kʃən ənd rᵻmúvəl bᵻkʌ́m əsɛ́nʃəl stɛ́ps."
            },
            {
                "ms": 181.233,
                "duration": 4.673000000000002,
                "tran": "sᵻ̀mᵻlərli, hǽndəlᵻŋ mᵻ̀sᵻŋ déɪtə, ɛnkóʊdᵻŋ kæ̀təɡɑ́rᵻkəl vɛ́riəbəlz, ənd fíʧər skéɪlᵻŋ ɑr váɪtəl ᵻn bᵻ̀ldᵻŋ əféktᵻv rəɡrɛ́ʃən mɒ́dəlz. "
            },
            {
                "ms": 190.538,
                "duration": 1.2159999999999798,
                "tran": "ᵻn ədᵻ̀ʃən, "
            },
            {
                "ms": 191.754,
                "duration": 7.515000000000015,
                "tran": "rəɡrɛ́ʃən ənǽlᵻsᵻs ɔ́fən nídz tə ɡrǽpəl wᵻð prɒ́bləmz láɪk mʌ̀ltikɔlᵻnɛ́rᵻti, wɛ́r tú ɔr mɔr fíʧərz ɑr háɪli kɔ́rəlèɪtᵻd,"
            },
            {
                "ms": 199.269,
                "duration": 6.210999999999984,
                "tran": "ənd hɛ̀təroʊskᵻdæ̀stᵻ̀sᵻti, wɛ́r ðə vɛ́riəns əv ɛ́rərz dᵻ̀fərz əkrɔ́s lɛ́vəlz əv ən ᵻ̀ndəpɛ́ndənt vɛ́riəbəl."
            },
            {
                "ms": 205.48,
                "duration": 3.5640000000000214,
                "tran": "tɛkníks sʌʧ æz vɛ́riəns ᵻ̀nfléɪʃən fǽktər (VIF) fɔr mʌ̀ltikɔlᵻnɛ́rᵻti ənd træ̀nsfərméɪʃənz ɔr wéɪtᵻd líst skwɛ́rz fɔr hɛ̀təroʊskᵻdæ̀stᵻ̀sᵻti ɑr ɛmplɔ́ᵻd tə hǽndəl ðiz ᵻ̀ʃuz."
            },
            {
                "ms": 216.758,
                "duration": 10.662999999999982,
                "tran": "mɔróʊvər, rəɡrɛ́ʃən əsʌ́mpʃənz sʌʧ æz lᵻ̀nierᵻti, ᵻ̀ndəpɛ́ndəns, hòʊməskᵻdæ̀stᵻ̀sᵻti, ənd nɔ̀rmǽlᵻti əv ɛ́rərz ɑr pᵻ̀vətəl tə mɒ́dəl væ̀lᵻ̀dᵻti ənd mʌst bi θɜ́roʊli ʧɛ́kt."
            },
            {
                "ms": 227.421,
                "duration": 6.473000000000013,
                "tran": "wᵻð mʌ́ltᵻpəl vɛ̀riéɪʃənz ənd ə hóʊst əv æ̀plᵻkéɪʃənz, rəɡrɛ́ʃən rəméɪnz ə méɪnstèɪ ᵻn súpərvàɪzd lɜ́rnᵻŋ."
            },
            {
                "ms": 233.894,
                "duration": 6.507000000000005,
                "tran": "hàʊɛ́vər, kɛ́r ʃʊd bi téɪkən tə ʌ̀ndərstǽnd ənd ǽdrɛ̀s ᵻts əsʌ́mpʃənz ənd pətɛ́nʃəl pᵻ̀tfɔ̀lz tə hɑ́rnəs ᵻts prədᵻ̀ktᵻv páʊər əfɛ́ktᵻvli. "
            },
            {
                "ms": 243.216,
                "duration": null,
                "tran": ""
            }
        ]
    }
]