[
    {
        "audioFileFullPath": "./audio/books/B002/B002C009_echo.mp3",
        "currentTimes": [
            {
                "ms": 0,
                "duration": 3.487,
                "tran": "ʌ̀nsúpərvàɪzd lɜ́rnᵻŋ - dᵻmɛ̀nʃənǽlᵻti rədʌ́kʃən. "
            },
            {
                "ms": 3.487,
                "duration": 6.759,
                "tran": "æz ðə kwɒ́ntᵻti əv déɪtə ᵻ̀nkrìsᵻz ᵻn ðə mɒ́dərn dᵻ̀ʤᵻtəl wɜ́rld, soʊ dʌz ðə dᵻmɛ̀nʃənǽlᵻti əv ðə déɪtə."
            },
            {
                "ms": 10.246,
                "duration": 2.9509999999999987,
                "tran": "wáɪl hǽvᵻŋ mɔr ᵻ̀nfərméɪʃən ᵻz bɛ̀nəfᵻ̀ʃəl,"
            },
            {
                "ms": 13.197,
                "duration": 3.0970000000000013,
                "tran": "háɪ-dᵻmɛ́nʃənəl déɪtə kən bi ʧǽlənʤᵻŋ tə wɜ́rk wᵻð,"
            },
            {
                "ms": 16.294,
                "duration": 3.541999999999998,
                "tran": "méɪnli djú tə ðə sóʊkɔ́ld 'kɜ́rs əv dᵻmɛ̀nʃənǽlᵻti',"
            },
            {
                "ms": 19.836,
                "duration": 10.739,
                "tran": "wᵻ̀ʧ əfɛ́kts ðə kɒ̀mpjutéɪʃənəl əfᵻ̀ʃənsi ənd pərfɔ́rməns əv məʃín lɜ́rnᵻŋ mɒ́dəlz. dᵻmɛ̀nʃənǽlᵻti rədʌ́kʃən kʌ́mz tə ðə rɛ́skju baɪ trænsfɔ́rmᵻŋ ðə déɪtə ᵻntu ə lóʊər-dᵻmɛ́nʃənəl spéɪs,"
            },
            {
                "ms": 30.575,
                "duration": 6.59,
                "tran": "ðɛ́rbáɪ méɪkᵻŋ ᵻt mɔr mǽnᵻʤəbəl ənd kɒ̀mprəhɛ́nsᵻbəl wᵻðáʊt sǽkrəfàɪsᵻŋ tú mʌʧ vǽljəbəl ᵻ̀nfərméɪʃən."
            },
            {
                "ms": 37.165,
                "duration": 7.813000000000002,
                "tran": "dᵻmɛ̀nʃənǽlᵻti rədʌ́kʃən tɛkníks kən bi klǽsᵻfàɪd ᵻntu tú brɔ́d kǽtəɡɔ̀riz: fíʧər səlɛ́kʃən ənd fíʧər əkstrǽkʃən."
            },
            {
                "ms": 44.978,
                "duration": 9.601999999999997,
                "tran": "fíʧər səlɛ́kʃən ᵻ̀nvɒ́lvz səlɛ́ktᵻŋ ə sʌ́bsɛ̀t əv ðə ərᵻ̀ʤᵻnəl fíʧərz wáɪl fíʧər əkstrǽkʃən kɒ́nstrəkts ə nu sɛ́t əv fíʧərz frəm ðə ərᵻ̀ʤᵻnəl wʌ́nz. "
            },
            {
                "ms": 54.58,
                "duration": 6.694000000000003,
                "tran": "prᵻ̀nsᵻpəl kəmpóʊnənt ənǽlᵻsᵻs (PCA) ᵻz əmʌ́ŋ ðə móʊst pɒ́pjələr fíʧər əkstrǽkʃən tɛkníks."
            },
            {
                "ms": 61.274,
                "duration": 6.486000000000004,
                "tran": "ᵻt wɜ́rks baɪ aɪdɛ́ntəfàɪᵻŋ ðə háɪpərpléɪn thət láɪz klóʊsəst tə ðə déɪtə ənd ðɛn prɒ́ʤɛkts ðə déɪtə ɒ́ntu ᵻt."
            },
            {
                "ms": 67.76,
                "duration": 12.915999999999997,
                "tran": "ðə ǽksᵻs thət əkspléɪnz ðə mǽksᵻməm vɛ́riəns ᵻn ðə déɪtə ᵻz ðə fɜ́rst prᵻ̀nsᵻpəl kəmpóʊnənt. ðə sɛ́kənd prᵻ̀nsᵻpəl kəmpóʊnənt ᵻz ɔrθɔ́ɡənəl tə ðə fɜ́rst ənd əkspléɪnz ðə mǽksᵻməm əmáʊnt əv rəméɪnᵻŋ vɛ́riəns, ənd soʊ ɒn."
            },
            {
                "ms": 80.676,
                "duration": 7.959000000000003,
                "tran": "ðə déɪtə ᵻz ðɛ́rbáɪ rɛ̀prəzɛ́ntᵻd ᵻn tɜ́rmz əv ᵻts prᵻ̀nsᵻpəl kəmpóʊnənts, wᵻ̀ʧ ɑr lᵻ̀niər kɒ̀mbᵻnéɪʃənz əv ðə ərᵻ̀ʤᵻnəl vɛ́riəbəlz."
            },
            {
                "ms": 88.635,
                "duration": 6.472999999999999,
                "tran": "PCA méɪks ðə əsʌ́mpʃən thət ðə prᵻ̀nsᵻpəl kəmpóʊnənts ɑr ə lᵻ̀niər kɒ̀mbᵻnéɪʃən əv ðə ərᵻ̀ʤᵻnəl fíʧərz."
            },
            {
                "ms": 95.108,
                "duration": 14.905000000000001,
                "tran": "ᵻn ᵻ̀nstənsᵻz wɛ́r ðᵻs ᵻz nɒt ðə kéɪs, nɒnlᵻ̀nìər dᵻmɛ̀nʃənǽlᵻti rədʌ́kʃən tɛkníks sʌʧ æz kɜ́rnəl PCA kən bi júzd. kɜ́rnəl PCA júsᵻz ðə séɪm kɒ́nsɛpt æz PCA bʌt əpláɪz ᵻt ᵻn ə háɪər-dᵻmɛ́nʃənəl fíʧər spéɪs ᵻ̀ndúst baɪ ə kɜ́rnəl fʌ́ŋkʃən. "
            },
            {
                "ms": 110.013,
                "duration": 6.162999999999997,
                "tran": "ənʌ́ðər pɒ́pjələr nɒnlᵻ̀nìər tɛkník ᵻz t-dᵻstrᵻ̀bjətᵻd stoʊkǽstᵻk néɪbər ɛmbɛ́dᵻŋ (t-SNE)."
            },
            {
                "ms": 116.176,
                "duration": 6.459999999999994,
                "tran": "ðᵻs mɛ́θəd rədjúsᵻz dᵻmɛ̀nʃənǽlᵻti wáɪl tráɪᵻŋ tə kíp sᵻ̀mᵻlər ᵻ̀nstənsᵻz kloʊs|kloʊz ənd dᵻsᵻ̀mᵻlər ᵻ̀nstənsᵻz əpɑ́rt."
            },
            {
                "ms": 122.636,
                "duration": 5.591000000000008,
                "tran": "ᵻ̀ts əspɛ́ʃəli əféktᵻv wɛ́n vᵻ̀ʒwəlàɪzᵻŋ háɪ-dᵻmɛ́nʃənəl déɪtəsɛ̀ts ᵻn tú ɔr θrí dᵻmɛ́nʃənz."
            },
            {
                "ms": 128.227,
                "duration": 2.8259999999999934,
                "tran": "lóʊkəli lᵻ̀niər ɛmbɛ́dᵻŋ (LLE) ᵻz ənʌ́ðər əféktᵻv mɛ́θəd əv nɒnlᵻ̀nìər dᵻmɛ̀nʃənǽlᵻti rədʌ́kʃən."
            },
            {
                "ms": 134.874,
                "duration": 6.206999999999994,
                "tran": "ʌ̀nláɪk PCA ənd t-SNE, LLE dʌz nɒt fóʊkəs ɒn prəzɜ́rvᵻŋ dᵻ̀stənsᵻz bitwín ᵻ̀nstənsᵻz. "
            },
            {
                "ms": 141.081,
                "duration": 8.475999999999999,
                "tran": "ᵻ̀nstɛ́d, ᵻt meɪntéɪnz rəléɪʃənʃᵻ̀ps ᵻn tɜ́rmz əv néɪbərz. ᵻf ən ᵻ̀nstəns ᵻz ə lᵻ̀niər kɒ̀mbᵻnéɪʃən əv ᵻts néɪbərz ᵻn ðə háɪ-dᵻmɛ́nʃənəl spéɪs, LLE wᵻl ənʃʊ́r ᵻt stéɪz thət weɪ ᵻn ðə lóʊər-dᵻmɛ́nʃənəl spéɪs. "
            },
            {
                "ms": 153.775,
                "duration": 6.0660000000000025,
                "tran": "ənʌ́ðər túl júzd ᵻn dᵻmɛ̀nʃənǽlᵻti rədʌ́kʃən ᵻz ɔ̀toʊɛnkʌ́ʊdərz, ə táɪp əv ɑ̀rtᵻfᵻ̀ʃəl nʊ́rəl nɛ́twɜ̀rk."
            },
            {
                "ms": 159.841,
                "duration": 9.932999999999993,
                "tran": "ən ɔ̀toʊɛnkʌ́ʊdər ᵻz dᵻzáɪnd tə lɜ́rn ən aɪdɛ́ntᵻtì fʌ́ŋkʃən ᵻn ən ʌ̀nsúpərvàɪzd mǽnər tə rìkənstrʌ́kt ðə ᵻ̀npʊ̀t déɪtə wáɪl tráɪᵻŋ tə ɛnkóʊd ðə déɪtə ᵻn ðə prɒ́sɛ̀s."
            },
            {
                "ms": 169.774,
                "duration": 6.50800000000001,
                "tran": "ðə aɪdíə ᵻz tə lɜ́rn ə kəmprɛ́st rɛ̀prəzɛntéɪʃən əv ðə déɪtə, əfɛ́ktᵻvli rədjúsᵻŋ ᵻts dᵻmɛ̀nʃənǽlᵻti. "
            },
            {
                "ms": 176.282,
                "duration": 6.46599999999998,
                "tran": "dᵻmɛ̀nʃənǽlᵻti rədʌ́kʃən tɛkníks nɒt óʊnli rədjús kɒ̀mpjutéɪʃənəl rísɔrs rəkwáɪrmənts ənd òʊvərfᵻ̀tᵻŋ bʌt kən ɔ́lsoʊ hɛ́lp ᵻn déɪtə vᵻ̀ʒwəlᵻzéɪʃən."
            },
            {
                "ms": 185.822,
                "duration": 9.094999999999999,
                "tran": "háɪ-dᵻmɛ́nʃənəl déɪtə kǽnɒt bi vᵻ̀ʒwəlàɪzd dᵻrɛ́kli, bʌt baɪ rədjúsᵻŋ ᵻt tə tú ɔr θrí dᵻmɛ́nʃənz, ᵻt kən bi plɒ́tᵻd ənd ʌ̀ndərstʊ́d mɔr ízəli."
            },
            {
                "ms": 194.917,
                "duration": 5.621999999999986,
                "tran": "ðᵻs éɪdz ᵻn ɡéɪnᵻŋ ᵻ̀nsàɪts ənd ʌ̀ndərstǽndᵻŋ strʌ́kʧərz ənd pǽtərnz wᵻðᵻ̀n ðə déɪtə. "
            },
            {
                "ms": 200.539,
                "duration": 4.794000000000011,
                "tran": "wʌ́n θᵻ̀ŋ tə rəmɛ́mbər ᵻz thət wáɪl dᵻmɛ̀nʃənǽlᵻti rədʌ́kʃən ᵻz júsfəl,"
            },
            {
                "ms": 205.333,
                "duration": 5.248999999999995,
                "tran": "ᵻ̀ts nɒt ɔ́lwèɪz nɛ́səsɛ̀ri ənd maɪt ívᵻn líd tə wɜ́rs pərfɔ́rməns fɔr sʌm tǽsks."
            },
            {
                "ms": 210.582,
                "duration": 2.741000000000014,
                "tran": "ᵻ̀ts krúʃəl tə kənsᵻ̀dər ðə néɪʧər əv ðə déɪtə, ðə prɒ́bləm æt hǽnd, ənd ðə spəsᵻ̀fᵻk mɒ́dəl bíᵻŋ júzd bìfɔ́r dᵻ̀sáɪdᵻŋ tə əpláɪ dᵻmɛ̀nʃənǽlᵻti rədʌ́kʃən."
            },
            {
                "ms": 220.043,
                "duration": 6.346000000000004,
                "tran": "ᵻn kənklúʒən, dᵻmɛ̀nʃənǽlᵻti rədʌ́kʃən ᵻz ən ᵻ̀nvǽljəbəl túl ᵻn ʌ̀nsúpərvàɪzd məʃín lɜ́rnᵻŋ."
            },
            {
                "ms": 226.389,
                "duration": 5.99199999999999,
                "tran": "ᵻt dílz wᵻð ðə háɪ dᵻmɛ̀nʃənǽlᵻti əv mɒ́dərn déɪtə, méɪkᵻŋ ᵻt mɔr mǽnᵻʤəbəl ənd kɒmprəhɛ́ndᵻbəl."
            },
            {
                "ms": 232.381,
                "duration": 4.561000000000007,
                "tran": "mɔróʊvər, ᵻt kəntrᵻ̀bjuts tə ðə ənhǽnsmənt əv kɒ̀mpjutéɪʃənəl əfᵻ̀ʃənsi, rədʌ́kʃən əv stɔ́rᵻʤ spéɪs, ənd ðə əbᵻ̀lᵻti tə vᵻ̀ʒwəlàɪz háɪ-dᵻmɛ́nʃənəl déɪtə. "
            },
            {
                "ms": 241.896,
                "duration": null,
                "tran": ""
            }
        ]
    }
]