[
    {
        "audioFileFullPath": "./audio/books/B002/B002C018_echo.mp3",
        "currentTimes": [
            {
                "ms": 0,
                "duration": 2.44,
                "tran": "L1 ənd L2 rɛ̀ɡjəléɪʃənz."
            },
            {
                "ms": 2.44,
                "duration": 8.96,
                "tran": "ᵻn məʃín lɜ́rnᵻŋ, rèɡjəlɛ̀rᵻzéɪʃən ᵻz ə tɛkník dᵻzáɪnd tə káʊntər òʊvərfᵻ̀tᵻŋ, ɛnhǽnsᵻŋ ðə ʤɛ̀nərəlᵻzéɪʃən əv ðə mɒ́dəl tə ʌ̀nsín déɪtə."
            },
            {
                "ms": 11.4,
                "duration": 6.301,
                "tran": "L1 ənd L2 rɛ̀ɡjəléɪʃənz, ɔ́fən tɜ́rmd æz lǽsu ənd rᵻ̀ʤ rèɡjəlɛ̀rᵻzéɪʃən rəspɛ́ktᵻvli,"
            },
            {
                "ms": 17.701,
                "duration": 4.559000000000001,
                "tran": "ɑr tú əv ðə móʊst kɒ́mən rèɡjəlɛ̀rᵻzéɪʃən mɛ́θədz ᵻn ðə fíld əv məʃín lɜ́rnᵻŋ."
            },
            {
                "ms": 22.26,
                "duration": 2.7349999999999994,
                "tran": "ðiz tɛkníks sʌ́təli ɔ́ltər ðə kɒ́st fʌ́ŋkʃən,"
            },
            {
                "ms": 24.995,
                "duration": 10.261,
                "tran": "ǽdᵻŋ ə pɛ́nəlti tɜ́rm tə prəmóʊt sᵻ̀mplər mɒ́dəlz ənd dᵻskɜ́rᵻʤ òʊvərfᵻ̀tᵻŋ. L1 rèɡjəlɛ̀rᵻzéɪʃən, nóʊn æz lǽsu (líst ǽbsəlùt ʃrᵻ̀ŋkᵻʤ ənd səlɛ́kʃən Operator),"
            },
            {
                "ms": 35.256,
                "duration": 5.811,
                "tran": "ᵻ̀ntrədúsᵻz ə pɛ́nəlti əkwᵻ̀vələnt tə ðə ǽbsəlùt vǽlju əv ðə mǽɡnᵻtùd əv kòʊəfᵻ̀ʃənts."
            },
            {
                "ms": 41.067,
                "duration": 6.713999999999999,
                "tran": "ðə ǽdᵻd tɜ́rm ᵻn ðə kɒ́st fʌ́ŋkʃən fɔr L1 rèɡjəlɛ̀rᵻzéɪʃən ᵻz ðə sʌ́m əv ðə ǽbsəlùt vǽljuz əv ðə wéɪts."
            },
            {
                "ms": 47.781,
                "duration": 3.3939999999999984,
                "tran": "ᵻt əfɛ́ktᵻvli rəstrᵻ̀kts ðə sáɪz əv ðə kòʊəfᵻ̀ʃənts,"
            },
            {
                "ms": 51.175,
                "duration": 4.134,
                "tran": "lídᵻŋ tə spɑ́rsər səlúʃənz wɛ́r sʌm kòʊəfᵻ̀ʃənts kən bᵻkʌ́m zíroʊ,"
            },
            {
                "ms": 55.309,
                "duration": 3.345000000000006,
                "tran": "ðɛ́rbáɪ əksklúdᵻŋ ðə kɔ̀rəspɒ́ndᵻŋ fíʧərz frəm ðə mɒ́dəl."
            },
            {
                "ms": 58.654,
                "duration": 9.079,
                "tran": "ðᵻs bᵻ̀ltᵻ̀n fíʧər səlɛ́kʃən kən bi bɛ̀nəfᵻ̀ʃəl ᵻn prǽktᵻs, pɑ̀rtᵻ̀kjələrli ᵻn háɪ-dᵻmɛ́nʃənəl déɪtə wɛ́r óʊnli ə sʌ́bsɛ̀t əv fíʧərz meɪ bi rɛ́ləvənt."
            },
            {
                "ms": 67.733,
                "duration": 8.694999999999993,
                "tran": "L2 rèɡjəlɛ̀rᵻzéɪʃən, ɔ́lsoʊ nóʊn æz rᵻ̀ʤ rèɡjəlɛ̀rᵻzéɪʃən, ǽdz ə pɛ́nəlti íkwəl tə ðə skwɛ́r əv ðə mǽɡnᵻtùd əv kòʊəfᵻ̀ʃənts."
            },
            {
                "ms": 76.428,
                "duration": 4.954000000000008,
                "tran": "ðə L2 tɜ́rm ᵻn ðə kɒ́st fʌ́ŋkʃən ᵻz ðə sʌ́m əv ðə skwɛ́rz əv ðə wéɪts. "
            },
            {
                "ms": 81.382,
                "duration": 9.97399999999999,
                "tran": "ðᵻs əpróʊʧ ənkɜ́rᵻʤᵻz smɔ́lər kòʊəfᵻ̀ʃənt vǽljuz bʌt dʌ́zənt fɔ́rs ðɛm tə zíroʊ. ᵻt tɛ́ndz tə rəzʌ́lt ᵻn mɒ́dəlz wɛ́r ɔl ðə fíʧərz ʃɛ́r ðə mɒ́dəlz bɜ́rdən mɔr íkwəli, ívᵻn ᵻf óʊnli ə fjú ɑr pɑ̀rtᵻ̀kjələrli sᵻɡnᵻ̀fᵻkənt. "
            },
            {
                "ms": 91.356,
                "duration": 3.216000000000008,
                "tran": "ívᵻn ᵻf óʊnli ə fjú ɑr pɑ̀rtᵻ̀kjələrli sᵻɡnᵻ̀fᵻkənt. "
            },
            {
                "ms": 94.572,
                "duration": 10.466999999999999,
                "tran": "ðə jus|juz əv L1 ɔr L2 rèɡjəlɛ̀rᵻzéɪʃən, ɔr ívᵻn ə kɒ̀mbᵻnéɪʃən əv bóʊθ, tɜ́rmd æz əlǽstᵻk nɛ́t, dəpɛ́ndz lɑ́rʤli ɒn ðə néɪʧər əv ðə prɒ́bləm ənd ðə déɪtə. "
            },
            {
                "ms": 105.039,
                "duration": 5.057000000000002,
                "tran": "L1 rèɡjəlɛ̀rᵻzéɪʃən maɪt bi prəfɜ́rd wɛ́n wi bəlív óʊnli ə fjú fíʧərz ɑr ᵻ̀mpɔ́rtənt,"
            },
            {
                "ms": 110.096,
                "duration": 2.4029999999999916,
                "tran": "djú tə ᵻts ᵻnhɛ́rənt fíʧər səlɛ́kʃən."
            },
            {
                "ms": 112.499,
                "duration": 4.001000000000005,
                "tran": "kɒ́nvərsli, ᵻf wi θᵻ̀ŋk ɔl fíʧərz kəntrᵻ̀bjut tə ðə áʊtpʊ̀t "
            },
            {
                "ms": 116.5,
                "duration": 1.9069999999999965,
                "tran": "bʌt tə vɛ́riəs dᵻɡríz, "
            },
            {
                "ms": 118.407,
                "duration": 3.361000000000004,
                "tran": "L2 rèɡjəlɛ̀rᵻzéɪʃən maɪt bi ə bɛ́tər ʧɔ́ᵻs."
            },
            {
                "ms": 121.768,
                "duration": 10.275000000000006,
                "tran": "əlǽstᵻk nɛ́t kəmbáɪnz ðə bɛ́st əv bóʊθ wɜ́rldz, meɪntéɪnᵻŋ ðə fíʧər səlɛ́kʃən prɒ́pərtiz əv L1 wáɪl téɪkᵻŋ ᵻntu əkáʊnt ðə fíʧər dᵻ̀strəbjúʃən prɒ́pərtiz əv L2."
            },
            {
                "ms": 132.043,
                "duration": 5.055999999999983,
                "tran": "hàʊɛ́vər, ðə tréɪdɔ̀f ᵻz thət ᵻt ᵻ̀ntrədúsᵻz ən ədᵻ̀ʃənəl hàɪpərpǽrəmətər tə tún."
            },
            {
                "ms": 137.099,
                "duration": 6.037000000000006,
                "tran": "rèɡjəlɛ̀rᵻzéɪʃən mɛ́θədz láɪk L1 ənd L2 wɜ́rk baɪ ǽdᵻŋ ə kənstréɪnt tə ðə kɒ́st fʌ́ŋkʃən."
            },
            {
                "ms": 143.136,
                "duration": 5.728000000000009,
                "tran": "hàʊɛ́vər, ðeɪ ɔ́lsoʊ ᵻ̀ntrədús ə hàɪpərpǽrəmətər ɔ́fən rəfɜ́rd tə æz lǽmdə ɔr ǽlfə."
            },
            {
                "ms": 148.864,
                "duration": 5.9269999999999925,
                "tran": "ðᵻs hàɪpərpǽrəmətər kəntróʊlz ðə strɛ́ŋkθ əv ðə rèɡjəlɛ̀rᵻzéɪʃən ənd nídz tə bi kɛ́rfəli kǽləbrèɪtᵻd. "
            },
            {
                "ms": 154.791,
                "duration": 5.9269999999999925,
                "tran": "ᵻf ᵻt ᵻz tú lɑ́rʤ, ðə rèɡjəlɛ̀rᵻzéɪʃən tɜ́rm dɒ́mᵻnèɪts ðə kɒ́st fʌ́ŋkʃən, lídᵻŋ tə ʌ̀ndərfᵻ̀tᵻŋ. "
            },
            {
                "ms": 160.718,
                "duration": 6.6340000000000146,
                "tran": "ɒn ðə ʌ́ðər hǽnd, ᵻf ᵻt ᵻz tú smɔ́l, ðə rèɡjəlɛ̀rᵻzéɪʃən əfɛ́kt maɪt bi nɛ́ɡlᵻʤᵻbəl, lídᵻŋ tə òʊvərfᵻ̀tᵻŋ. "
            },
            {
                "ms": 167.352,
                "duration": 5.703000000000003,
                "tran": "səlɛ́ktᵻŋ ən əpróʊprièɪt rèɡjəlɛ̀rᵻzéɪʃən strɛ́ŋkθ ᵻz ʤɛ́nərəli dʌ́n váɪə krɔ́s-væ̀lᵻdéɪʃən, ə kɒ́nsɛpt wi wᵻl kʌ́vər ᵻn ə léɪtər ʧǽptər. "
            },
            {
                "ms": 175.884,
                "duration": 5.805000000000007,
                "tran": "ᵻn prǽktᵻs, əpláɪᵻŋ L1 ɔr L2 rèɡjəlɛ̀rᵻzéɪʃən rəkwáɪərz ə stǽndərdàɪzd déɪtəsɛ̀t, hɛ́ns nɔ̀rməlᵻzéɪʃən ᵻz ə nɛ́səsɛ̀ri prìprʌ́ʊsɛsᵻŋ stɛ́p."
            },
            {
                "ms": 185.428,
                "duration": 4.6839999999999975,
                "tran": "ðᵻs ᵻz bᵻkɒ́z rèɡjəlɛ̀rᵻzéɪʃən ᵻz sɛ́nsᵻtᵻv tə ðə skéɪl əv ᵻ̀npʊ̀t fíʧərz. "
            },
            {
                "ms": 190.112,
                "duration": 8.53200000000001,
                "tran": "A fíʧər wᵻð ə nǽʧərəli lɑ́rʤər skéɪl wᵻl həv ə kɔ̀rəspɒ́ndᵻŋli lɑ́rʤər kòʊəfᵻ̀ʃənt, lídᵻŋ tə ə dᵻ̀sprəpɔ́rʃənᵻt ᵻ̀mpækt|ᵻmpǽkt ɒn ðə kɒ́st fʌ́ŋkʃən. "
            },
            {
                "ms": 198.644,
                "duration": 1.4489999999999839,
                "tran": "ᵻn kənklúʒən,"
            },
            {
                "ms": 200.093,
                "duration": 9.313000000000017,
                "tran": "L1 ənd L2 rèɡjəlɛ̀rᵻzéɪʃən ɑr páʊərfəl tɛkníks fɔr prəvɛ́ntᵻŋ òʊvərfᵻ̀tᵻŋ ənd ᵻ̀mprúvᵻŋ ðə ʤɛ̀nərəlᵻzéɪʃən əbᵻ̀lᵻti əv məʃín lɜ́rnᵻŋ mɒ́dəlz."
            },
            {
                "ms": 209.406,
                "duration": 3.3940000000000055,
                "tran": "ðeɪ əkɒ́mplᵻʃ ðᵻs baɪ kənstréɪnᵻŋ ðə mɒ́dəlz kəmplɛ́ksᵻti ənd ənkɜ́rᵻʤᵻŋ sᵻ̀mplər, mɔr roʊbʌ́st səlúʃənz."
            },
            {
                "ms": 216.28,
                "duration": 7.6159999999999854,
                "tran": "ʌ̀ndərstǽndᵻŋ wɛ́n ənd háʊ tə əpláɪ ðiz rèɡjəlɛ̀rᵻzéɪʃən tɛkníks ᵻz ə kí skᵻ̀l fɔr ɛ́ni məʃín lɜ́rnᵻŋ præktᵻ̀ʃənər. "
            },
            {
                "ms": 223.896,
                "duration": null,
                "tran": ""
            }
        ]
    }
]