[
    {
        "audioFileFullPath": "./audio/books/B002/B002C005_echo.mp3",
        "currentTimes": [
            {
                "ms": 0,
                "duration": 1.241,
                "tran": "klæ̀sᵻfəkéɪʃən. "
            },
            {
                "ms": 1.241,
                "duration": 5.709999999999999,
                "tran": "klæ̀sᵻfəkéɪʃən ᵻz ðə tǽsk əv əsáɪnᵻŋ prìdəfáɪnd léɪbəlz tə ᵻ̀nstənsᵻz béɪst ɒn ðɛr fíʧərz."
            },
            {
                "ms": 6.951,
                "duration": 3.798000000000001,
                "tran": "wɛrǽz rəɡrɛ́ʃən fóʊkəsᵻz ɒn prədᵻ̀ktᵻŋ kəntᵻ̀njuəs áʊtkʌ̀mz, klæ̀sᵻfəkéɪʃən éɪmz tə prədᵻ̀kt kæ̀təɡɑ́rᵻkəl áʊtkʌ̀mz."
            },
            {
                "ms": 14.177,
                "duration": 6.98,
                "tran": "ᵻt ᵻz júzd wáɪdli ᵻn daɪvɜ́rs doʊméɪnz láɪk mɛ́dᵻkəl dàɪəɡnɒ́stᵻks, spǽm dᵻtɛ́kʃən, sɛ́ntᵻmənt ənǽlᵻsᵻs, ənd mɔr."
            },
            {
                "ms": 21.157,
                "duration": 7.908999999999999,
                "tran": "wʌ́n əv ðə sᵻ̀mpləst ənd ɜ́rliəst fɔ́rmz əv klæ̀sᵻfəkéɪʃən tɛkníks ᵻz ðə pərsɛ́ptrɒn, ᵻ̀nspáɪərd baɪ ðə kɒ́nsɛpt əv ə bàɪəlɒ́ʤᵻkəl nʊ́rɒn."
            },
            {
                "ms": 29.066,
                "duration": 3.448000000000004,
                "tran": "A pərsɛ́ptrɒn kəmbáɪnz ᵻ̀npʊ̀ts wᵻð ðɛr wéɪts ənd əpláɪz ə stɛ́p fʌ́ŋkʃən tə ʤɛ́nərèɪt báɪnəri áʊtpʊ̀t."
            },
            {
                "ms": 36.049,
                "duration": 10.049,
                "tran": "dᵻspáɪt ᵻts sᵻmplᵻ̀sᵻti, ᵻt óʊnli wɜ́rks fɔr lᵻ̀niərli sɛ́pərəbəl déɪtə ənd ᵻz ənéɪbəl tə sɒ́lv prɒ́bləmz wɛ́r déɪtə pɔ́ᵻnts kǽnɒt bi dᵻváɪdᵻd baɪ ə stréɪt láɪn ɔr háɪpərpléɪn. "
            },
            {
                "ms": 46.098,
                "duration": 7.902999999999999,
                "tran": "tə óʊvərkʌ̀m ðiz lᵻ̀mᵻtéɪʃənz, ləʤᵻ̀stᵻk rəɡrɛ́ʃən wɒz ᵻ̀ntrədúst, wᵻ̀ʧ dᵻspáɪt ᵻts néɪm, ᵻz júzd fɔr klæ̀sᵻfəkéɪʃən."
            },
            {
                "ms": 54.001,
                "duration": 5.539999999999999,
                "tran": "ᵻt kǽlkjəlèɪts ə wéɪtᵻd sʌ́m əv ðə fíʧərz plʌ́s ə báɪəs tɜ́rm, sᵻ̀mᵻlər tə lᵻ̀niər rəɡrɛ́ʃən."
            },
            {
                "ms": 59.541,
                "duration": 5.27000000000001,
                "tran": "stᵻ̀l, ᵻt əpláɪz ə ləʤᵻ̀stᵻk fʌ́ŋkʃən tə áʊtpʊ̀t ə vǽlju bitwín 0 ənd 1."
            },
            {
                "ms": 64.811,
                "duration": 7.915999999999997,
                "tran": "ðᵻs vǽlju kən bi ᵻ̀ntɜ́rprətᵻd æz ðə prɒ̀bəbᵻ̀lᵻti əv ə pɑ̀rtᵻ̀kjələr klǽs ənd ᵻz θréʃhoʊldᵻd tə áʊtpʊ̀t ə báɪnəri klæ̀sᵻfəkéɪʃən. "
            },
            {
                "ms": 72.727,
                "duration": 10.403999999999996,
                "tran": "hàʊɛ́vər, báɪnəri klæ̀sᵻfəkéɪʃən tɛkníks láɪk ləʤᵻ̀stᵻk rəɡrɛ́ʃən ɔr ðə pərsɛ́ptrɒn ɑr ᵻ̀nsəfᵻ̀ʃənt fɔr mʌ́lti-klǽs prɒ́bləmz, wɛ́r ðɛr ɑr mɔr ðʌn tú klǽsᵻz tə prədᵻ̀kt."
            },
            {
                "ms": 83.131,
                "duration": 14.680999999999997,
                "tran": "strǽtəʤiz láɪk wʌ́n-vɜ́rsəs-ɔl ənd wʌ́n-vɜ́rsəs-wʌ́n həv bᵻn ɛmplɔ́ᵻd tə əkstɛ́nd báɪnəri klǽsᵻfaɪərz tə mʌ́lti-klǽs prɒ́bləmz. səpɔ́rt vɛ́ktər məʃínz (SVMs) həv prúvən əféktᵻv fɔr bóʊθ báɪnəri ənd mʌ́lti-klǽs klæ̀sᵻfəkéɪʃən."
            },
            {
                "ms": 97.812,
                "duration": 10.195000000000007,
                "tran": "ðeɪ éɪm tə fáɪnd ə háɪpərpléɪn thət sɛ́pərèɪts ðə klǽsᵻz wáɪl mǽksᵻmàɪzᵻŋ ðə mɑ́rʤən bitwín ðə klóʊsəst pɔ́ᵻnts (səpɔ́rt vɛ́ktərz) tə ðə háɪpərpléɪn frəm iʧ klǽs."
            },
            {
                "ms": 108.007,
                "duration": 8.826999999999998,
                "tran": "ðə 'kɜ́rnəl trᵻ̀k' kən bi ɛmplɔ́ᵻd tə mǽp déɪtə tə ə háɪər-dᵻmɛ́nʃənəl spéɪs, méɪkᵻŋ SVMs kéɪpəbəl əv hǽndəlᵻŋ nɒn-lᵻ̀niərli sɛ́pərəbəl déɪtə. "
            },
            {
                "ms": 116.834,
                "duration": 8.280000000000001,
                "tran": "ənʌ́ðər ɡrúp əv klǽsᵻfaɪərz nóʊn æz trí-béɪst mɛ́θədz, ᵻ̀nklúdᵻŋ dəsᵻ̀ʒən tríz ənd rǽndəm fɔ́rəsts, ɔ́fər háɪ ᵻntərprɛtəbᵻ̀lᵻti."
            },
            {
                "ms": 125.114,
                "duration": 8.977000000000004,
                "tran": "A dəsᵻ̀ʒən trí splᵻ̀ts ðə déɪtə béɪst ɒn fíʧər vǽljuz, tráɪᵻŋ tə áɪsəlèɪt ðə klǽsᵻz æt iʧ nóʊd ʌ̀ntᵻ̀l pjʊ́r ɔr nɪ́r-pjʊ́r líf nóʊdz ɑr əʧívd."
            },
            {
                "ms": 134.091,
                "duration": 11.052999999999997,
                "tran": "rǽndəm fɔ́rəsts bᵻ̀ld ɒn dəsᵻ̀ʒən tríz' strɛ́ŋkθs baɪ kəmbáɪnᵻŋ mʌ́ltᵻpəl tríz tə rədjús òʊvərfᵻ̀tᵻŋ ənd ᵻ̀mprúv prədᵻ̀kʃən roʊbʌ́stnəs. wʌ́n ʃʊd ɔ́lsoʊ mɛ́nʃən ɒnsɒ́mbəl lɜ́rnᵻŋ tɛkníks, wᵻ̀ʧ kɒ́mbaɪn mʌ́ltᵻpəl klǽsᵻfaɪərz' prədᵻ̀kʃənz tə jíld ə fáɪnəl prədᵻ̀kʃən, ɔ́fən ᵻ̀nkrísᵻŋ ǽkjərəsi."
            },
            {
                "ms": 151.691,
                "duration": 4.158999999999992,
                "tran": "kɒ́mən mɛ́θədz ᵻ̀nklúd bǽɡᵻŋ, bústᵻŋ, ənd stǽkᵻŋ. "
            },
            {
                "ms": 155.85,
                "duration": 7.731999999999999,
                "tran": "fɜ́rðərmɔ̀r, nʊ́rəl nɛ́twɜ̀rks ənd ðɛr əkstɛ́nʃənz, ᵻ̀nklúdᵻŋ díp nʊ́rəl nɛ́twɜ̀rks, kənvəlúʃənəl nʊ́rəl nɛ́twɜ̀rks, ənd rəkɜ́rənt nʊ́rəl nɛ́twɜ̀rks, həv əksɛ́ld ᵻn kɒ́mplɛks klæ̀sᵻfəkéɪʃən tǽsks, ɔ́fərᵻŋ háɪ pərfɔ́rməns æt ðə kɒ́st əv ᵻntərprɛtəbᵻ̀lᵻti. "
            },
            {
                "ms": 170.182,
                "duration": 5.146000000000015,
                "tran": "kí tə əféktᵻv klæ̀sᵻfəkéɪʃən ᵻz ðə səlɛ́kʃən əv ən əpróʊprièɪt pərfɔ́rməns mɛ́trᵻk."
            },
            {
                "ms": 175.328,
                "duration": 6.545999999999992,
                "tran": "ǽkjərəsi, prəsᵻ̀ʒən, ríkɔ̀l, F1-score, ənd ðə ɛ́riə ʌ́ndər ðə ROC kɜ́rv ɑr kɒ́mənli júzd."
            },
            {
                "ms": 181.874,
                "duration": 6.405000000000001,
                "tran": "fɔr ᵻmbǽlənst déɪtəsɛ̀ts, prəsᵻ̀ʒən, ríkɔ̀l, ənd F1-score ɑr ɔ́fən mɔr ᵻ̀nfɔ́rmətᵻv ðʌn ǽkjərəsi."
            },
            {
                "ms": 188.279,
                "duration": 8.11699999999999,
                "tran": "A kənfjúʒən méɪtrᵻks, wᵻ̀ʧ tǽbjəleɪts trú ənd fɔ́ls pɒ́zᵻtᵻvz ənd nɛ́ɡətᵻvz, ᵻz ɔ́lsoʊ ə hɛ́lpfəl túl fɔr ʌ̀ndərstǽndᵻŋ klǽsᵻfaɪər pərfɔ́rməns."
            },
            {
                "ms": 196.396,
                "duration": 3.4720000000000084,
                "tran": "déɪtə prɛ̀pəréɪʃən, ᵻ̀nklúdᵻŋ hǽndəlᵻŋ mᵻ̀sᵻŋ déɪtə, fíʧər ɛ́nʤᵻnɪ́rᵻŋ, ɛnkóʊdᵻŋ kæ̀təɡɑ́rᵻkəl vɛ́riəbəlz, ənd déɪtə nɔ̀rməlᵻzéɪʃən, ᵻz krúʃəl fɔr əféktᵻv klæ̀sᵻfəkéɪʃən, ʤəst æz ᵻt ᵻz ᵻn rəɡrɛ́ʃən. "
            },
            {
                "ms": 209.345,
                "duration": 6.7309999999999945,
                "tran": "æz wᵻð ɔl məʃín lɜ́rnᵻŋ tɛkníks, òʊvərfᵻ̀tᵻŋ ənd ʌ̀ndərfᵻ̀tᵻŋ rəméɪn kənsɜ́rnz ᵻn klæ̀sᵻfəkéɪʃən tǽsks."
            },
            {
                "ms": 216.076,
                "duration": 7.806000000000012,
                "tran": "æz wᵻð ɔl məʃín lɜ́rnᵻŋ tɛkníks, òʊvərfᵻ̀tᵻŋ ənd ʌ̀ndərfᵻ̀tᵻŋ rəméɪn kənsɜ́rnz ᵻn klæ̀sᵻfəkéɪʃən tǽsks."
            },
            {
                "ms": 223.882,
                "duration": 2.1670000000000016,
                "tran": "ʌ̀ndərfᵻ̀tᵻŋ, ɒn ðə ʌ́ðər hǽnd,"
            },
            {
                "ms": 226.049,
                "duration": 4.784999999999997,
                "tran": "hǽpənz wɛ́n ðə mɒ́dəl féɪlz tə kǽpʧər ðə ʌ̀ndərláɪᵻŋ pǽtərnz ᵻn ðə déɪtə."
            },
            {
                "ms": 230.834,
                "duration": 6.861999999999995,
                "tran": "tɛkníks sʌʧ æz krɔ́s-væ̀lᵻdéɪʃən, rèɡjəlɛ̀rᵻzéɪʃən, ənd ɜ́rli stɒ́pᵻŋ kən hɛ́lp ǽdrɛ̀s ðiz ᵻ̀ʃuz."
            },
            {
                "ms": 237.696,
                "duration": 5.600999999999999,
                "tran": "klæ̀sᵻfəkéɪʃən ɔ́fərz ə wáɪd əréɪ əv tɛkníks sútᵻd tə dᵻ̀fərənt tǽsks ənd déɪtə táɪps."
            },
            {
                "ms": 243.297,
                "duration": 7.447000000000003,
                "tran": "ʌ̀ndərstǽndᵻŋ ðɛr strɛ́ŋkθs, wíknəsᵻz, ənd ʌ̀ndərláɪᵻŋ əsʌ́mpʃənz kən ɡáɪd ðə səlɛ́kʃən ənd æ̀plᵻkéɪʃən əv ðiz mɛ́θədz, əláʊᵻŋ wʌ́n tə ʌ̀nlɒ́k vǽljəbəl ᵻ̀nsàɪts frəm kæ̀təɡɑ́rᵻkəl déɪtə. "
            },
            {
                "ms": 255.192,
                "duration": null,
                "tran": ""
            }
        ]
    }
]