[
    {
        "audioFileFullPath": "./audio/books/B002/B002C014_echo.mp3",
        "currentTimes": [
            {
                "ms": 0,
                "duration": 1.752,
                "tran": "fíʧər ɛ́nʤᵻnɪ́rᵻŋ. "
            },
            {
                "ms": 1.752,
                "duration": 11.689,
                "tran": "fíʧər ɛ́nʤᵻnɪ́rᵻŋ ᵻz ə krúʃəl stɛ́p ᵻn ðə məʃín lɜ́rnᵻŋ páɪplàɪn thət ᵻ̀nvɒ́lvz səlɛ́ktᵻŋ ənd trænsfɔ́rmᵻŋ rɛ́ləvənt vɛ́riəbəlz frəm rɔ́ déɪtə ᵻntu fíʧərz thət ɑr sútəbəl fɔr mɒ́dəlᵻ̀ŋ."
            },
            {
                "ms": 13.441,
                "duration": 4.984,
                "tran": "ðə ɡóʊl əv fíʧər ɛ́nʤᵻnɪ́rᵻŋ ᵻz tə kriéɪt ə sɛ́t əv fíʧərz thət ɑr rɛ́ləvənt, mínᵻŋfəl, ənd júsfəl fɔr ðə məʃín lɜ́rnᵻŋ ǽlɡərᵻ̀ðəm tə lɜ́rn pǽtərnz ənd rəléɪʃənʃᵻ̀ps ᵻn ðə déɪtə. "
            },
            {
                "ms": 24.661,
                "duration": 4.405999999999999,
                "tran": "fíʧər ɛ́nʤᵻnɪ́rᵻŋ tᵻ̀pᵻkəli ᵻ̀nvɒ́lvz sɛ́vərəl stɛ́ps, ᵻ̀nklúdᵻŋ:"
            },
            {
                "ms": 29.067,
                "duration": 1.4149999999999991,
                "tran": "fíʧər səlɛ́kʃən:"
            },
            {
                "ms": 30.482,
                "duration": 7.352000000000004,
                "tran": "ðᵻs stɛ́p ᵻ̀nvɒ́lvz aɪdɛ́ntəfàɪᵻŋ ðə móʊst rɛ́ləvənt fíʧərz frəm ðə rɔ́ déɪtə thət ɑr rɛ́ləvənt tə ðə prɒ́bləm æt hǽnd."
            },
            {
                "ms": 37.834,
                "duration": 5.386999999999993,
                "tran": "ðᵻs ᵻz ɔ́fən dʌ́n baɪ ǽnəlàɪzᵻŋ ðə kɔ̀rəléɪʃən bitwín ðə fíʧərz ənd ðə tɑ́rɡət vɛ́riəbəl, æz wɛ́l æz baɪ kənsᵻ̀dərᵻŋ doʊméɪn nɒ́lᵻʤ ənd ðə ʌ̀ndərláɪᵻŋ fᵻ̀zᵻks əv ðə prɒ́bləm."
            },
            {
                "ms": 48.933,
                "duration": 1.9789999999999992,
                "tran": "fíʧər træ̀nsfərméɪʃən:"
            },
            {
                "ms": 50.912,
                "duration": 7.247,
                "tran": "wʌ́ns ðə rɛ́ləvənt fíʧərz həv bᵻn səlɛ́ktᵻd, ðeɪ meɪ níd tə bi trænsfɔ́rmd tə mít ðə rəkwáɪrmənts əv ðə məʃín lɜ́rnᵻŋ ǽlɡərᵻ̀ðəm."
            },
            {
                "ms": 58.159,
                "duration": 5.477000000000004,
                "tran": "ðᵻs meɪ ᵻ̀nvɒ́lv skéɪlᵻŋ, nɔ́rməlàɪzᵻŋ, ɔr ɛnkóʊdᵻŋ kæ̀təɡɑ́rᵻkəl vɛ́riəbəlz."
            },
            {
                "ms": 63.636,
                "duration": 2.134999999999998,
                "tran": "dᵻmɛ̀nʃənǽlᵻti rədʌ́kʃən:"
            },
            {
                "ms": 65.771,
                "duration": 5.2690000000000055,
                "tran": "háɪ-dᵻmɛ́nʃənəl déɪtə kən bi dᵻ̀fᵻkəlt tə ǽnəlàɪz ənd meɪ lɛ́d|líd tə ðə kɜ́rs əv dᵻmɛ̀nʃənǽlᵻti, wɛ́r ðə vɒ́ljum əv ðə fíʧər spéɪs ᵻ̀nkrìsᵻz ɛ̀kspoʊnɛ́nʃəli wᵻð ðə nʌ́mbər əv fíʧərz."
            },
            {
                "ms": 76.29,
                "duration": 9.055999999999997,
                "tran": "dᵻmɛ̀nʃənǽlᵻti rədʌ́kʃən tɛkníks, sʌʧ æz prᵻ̀nsᵻpəl kəmpóʊnənt ənǽlᵻsᵻs (PCA) ɔr sᵻ̀ŋɡjələr vǽlju dìkəmpəzᵻ̀ʃən (SVD), kən bi júzd tə rədjús ðə nʌ́mbər əv fíʧərz wáɪl prəzɜ́rvᵻŋ ðə móʊst ᵻ̀mpɔ́rtənt ᵻ̀nfərméɪʃən."
            },
            {
                "ms": 90.623,
                "duration": 5.411000000000001,
                "tran": "fíʧər kriéɪʃən: ᵻn sʌm kéɪsᵻz, nu fíʧərz kən bi kriéɪtᵻd frəm ᵻɡzᵻ̀stᵻŋ wʌ́nz."
            },
            {
                "ms": 96.034,
                "duration": 8.438999999999993,
                "tran": "fɔr ᵻɡzǽmpəl, pɒ̀lìnóʊmiəl træ̀nsfərméɪʃənz kən bi əpláɪd tə ᵻɡzᵻ̀stᵻŋ fíʧərz tə kriéɪt nu wʌ́nz thət meɪ kǽpʧər nɒnlᵻ̀nìər rəléɪʃənʃᵻ̀ps."
            },
            {
                "ms": 104.473,
                "duration": 2.4039999999999964,
                "tran": "fíʧər səlɛ́kʃən ənd əvæ̀ljuéɪʃən:"
            },
            {
                "ms": 106.877,
                "duration": 7.51100000000001,
                "tran": "ǽftər trænsfɔ́rmᵻŋ ənd rədjúsᵻŋ ðə dᵻmɛ̀nʃənǽlᵻti əv ðə déɪtə, ðə nɛ́kst stɛ́p ᵻz tə səlɛ́kt ðə móʊst rɛ́ləvənt fíʧərz fɔr mɒ́dəlᵻ̀ŋ."
            },
            {
                "ms": 114.388,
                "duration": 9.48899999999999,
                "tran": "ðᵻs kən bi dʌ́n júzᵻŋ vɛ́riəs mɛ́θədz, sʌʧ æz kɔ̀rəléɪʃən ənǽlᵻsᵻs, mjúʧuəl ᵻ̀nfərméɪʃən, ənd rəkɜ́rsᵻv fíʧər əlᵻ̀mᵻnéɪʃən (RFE)."
            },
            {
                "ms": 123.877,
                "duration": 7.536999999999992,
                "tran": "fíʧər ɛ́nʤᵻnɪ́rᵻŋ ᵻz ə krᵻ̀tᵻkəl stɛ́p ᵻn ðə məʃín lɜ́rnᵻŋ páɪplàɪn, æz ᵻt kən sᵻɡnᵻ̀fᵻkəntli ᵻ̀mpækt ðə pərfɔ́rməns əv ðə mɒ́dəl."
            },
            {
                "ms": 131.414,
                "duration": 5.338000000000022,
                "tran": "A wɛ́l-ɛ̀nʤᵻnírd sɛ́t əv fíʧərz kən ᵻ̀mprúv ðə ǽkjərəsi ənd ᵻntərprɛtəbᵻ̀lᵻti əv ðə mɒ́dəl,"
            },
            {
                "ms": 136.752,
                "duration": 6.606999999999999,
                "tran": "wáɪl ə pɔ́rli ɛ̀nʤᵻnírd sɛ́t əv fíʧərz kən lɛ́d|líd tə pɔ́r pərfɔ́rməns ənd dᵻ̀fᵻkəlti ᵻn mɒ́dəl ᵻ̀ntɜ̀rprᵻtéɪʃən."
            },
            {
                "ms": 143.359,
                "duration": 1.1769999999999925,
                "tran": "ᵻn sʌ́məri,"
            },
            {
                "ms": 144.536,
                "duration": 8.164999999999992,
                "tran": "fíʧər ɛ́nʤᵻnɪ́rᵻŋ ᵻz ə krúʃəl stɛ́p ᵻn ðə məʃín lɜ́rnᵻŋ páɪplàɪn thət ᵻ̀nvɒ́lvz səlɛ́ktᵻŋ ənd trænsfɔ́rmᵻŋ rɛ́ləvənt vɛ́riəbəlz frəm rɔ́ déɪtə ᵻntu fíʧərz thət ɑr sútəbəl fɔr mɒ́dəlᵻ̀ŋ."
            },
            {
                "ms": 155.259,
                "duration": 1.9610000000000127,
                "tran": "ᵻt ᵻ̀nklúdz sɛ́vərəl stɛ́ps, "
            },
            {
                "ms": 157.22,
                "duration": 1.7050000000000125,
                "tran": "sʌʧ æz fíʧər səlɛ́kʃən, "
            },
            {
                "ms": 158.925,
                "duration": 1.5609999999999786,
                "tran": "fíʧər træ̀nsfərméɪʃən, "
            },
            {
                "ms": 160.486,
                "duration": 5.641999999999996,
                "tran": "dᵻmɛ̀nʃənǽlᵻti rədʌ́kʃən, fíʧər kriéɪʃən, ənd fíʧər səlɛ́kʃən ənd əvæ̀ljuéɪʃən."
            },
            {
                "ms": 166.128,
                "duration": 8.396000000000015,
                "tran": "baɪ kɛ́rfəli ɛ́nʤᵻnɪ́rᵻŋ fíʧərz, məʃín lɜ́rnᵻŋ mɒ́dəlz kən lɜ́rn pǽtərnz ənd rəléɪʃənʃᵻ̀ps ᵻn ðə déɪtə mɔr əfɛ́ktᵻvli, lídᵻŋ tə ᵻ̀mprúvd pərfɔ́rməns ənd ᵻntərprɛtəbᵻ̀lᵻti."
            },
            {
                "ms": 177.72,
                "duration": null,
                "tran": ""
            }
        ]
    }
]